{"pages":[{"title":"About","text":"Sweet, now it works!Our online content and identities are becoming more important and sometimes even critical to our lives. Neither are secure in the hands of random ephemeral startups or big silos. We should be the holders of our online presence.","link":"/about/index.html"},{"title":"projects","text":"","link":"/projects/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"Tools","text":"ProblemsThe number of methods and techniques that should help in innovation process &amp; product development is overhelming.Some information is available online, some offline in books and difficult to acceessSolutionA collection of techniques which are mainstream collected and presented in one placesaves timeorganizes knowledgehelps to explain to other","link":"/tools/index.html"},{"title":"Innovation Playbook - Black Horse Techniques","text":"","link":"/tools/innovation-playboook.html"}],"posts":[{"title":"verduroBox","text":"This project will soon be updated.","link":"/2019/07/26/verduroBox/"},{"title":"Pigeon Pizza","text":"Pigeon Pizza an interactive cover letter.Bored with writing cover letters? Even more bored with reading them? Be happy! Pigeon Pizza will let youmake pizza-ntastic cover letter!","link":"/2016/07/26/pigeonPizza/"},{"title":"asteroidos.org","text":"The good product needs a good website. Especially a hack product that delivers completely new services to the user.After a few months of work spent on improving and developing new features for the asteroidOS operating system and just beforethe alpha release the need for a new website, with great usr experience was bigger than ever!Quick StartWelcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.Create a new post1$ hexo new \"My New Post\"More info: WritingDOCUMENTATIONMore info: DeploymentQuick StartQuick Startsefhfkhk","link":"/2017/09/26/asteroidWebsite/"},{"title":"Kurpisz Impresariat","text":"Events-tracking app. Never miss your favorite artists gigs in the hood!","link":"/2016/07/26/impresariat/"},{"title":"Berliner Braumeister!","text":"Psssss…. It’s a beer time!","link":"/2017/02/12/BerlinerBraumeister/"},{"title":"Ping Pong Town","text":"Ping Pong Town is a free and open-source community app deesigned &amp; developed by small team at SPICED Academy Bootcamp. It is a web-based application build with React, Google Maps and node.js. Current version is successfuly reach “working prototype” status.FunctionalityUse CasesFind public ping pong tables around the cityCheck the availability of the table; join or check into the tableAdd new spots with exacts location, image and descriptionFind about about ping-pong events around meParticipate in events, contests, collect points and be highest in the ranking!Communicate with others to meet people and have fun with themMVPUser profilesInteractive map with check in funtionalityGallery page and data base with a list of known ping pong tablesClub page connect with the user profile with events list and score boardClickable prototypeWorkflowCode1$ hexo serverMore info: PingPong Town RepoCollaboration - Retrospectives","link":"/2019/05/17/pingPongTown/"},{"title":"viffie - virtual office for remote work","text":"viffie is an application that allows a user or the group of users collaborate, communicate and interact without the spacial borders in the real time.Market ResearchThe goal of the market research was to define the potential competitors on the market, their strengths, and weaknesses and to determine the business goals for viffie. At this stage, the Most Viable Product features were proposed herewith the competitor analysis and existing task and management applications comparison and results of the first survey “Working remotely in a virtual office.”User Researchviffie is an application that focuses on the user needs. Understanding how people work remotely and what they need to success in their jobs was crucial to this project.Thanks to several interviews with potential users of viffie I have created primary, secondary and complementary target groups along with four User Personas. The next step was creating the user experience map and task modeling which revealed the pain points and critical moments while working remotely. This knowledge opened the new ways to improve viffie MVPs.Idea ConceptionIdea ConceptionA great set of data collected during the market and user research was further analyzed, which gave me a clear view of where viffie is heading.The conceptual phase was conducted with the set of assumptions concluded from the analysis of user needs and business goals.Finding The right StructureAt this point, I had a clear idea of the business goals and user needs and enough information to start organizing the structure of the content. The project was divided on web page and application.Information Architecture on web page was created with AARRR technique and considered future marketing and social media campaigns.The goal of IA set up for application was to create a modular, flexible yet easy to use and efficient software. In order to achieve this goal, the “Sliders” columns idea was presented and the information architecture designed in the way that allows the user accessing every feature from any point.Giving It ShapeFinding The right StructureAt this point, I had a clear idea of the business goals and user needs and enoughinformation to start organizing the structure of the content.The project was divided on web page and application.Information Architecture on web page was created with AARRR technique and considered future marketing and social media campaigns.The goal of IA set up for application was to create a modular, flexible yet easy to use and efficient software. In order to achieve this goal, the “Sliders” columns idea was presented and the information architecture designed in the way that allows the user accessing every feature from any point.Giving it ShapeThe Lean UX approach, design-validate- iterate, was present during the whole process of creating viffie.The time for visualizing the ideas and concepts arrived so I created a set of paper prototypes which were tested on a group of users.The results of those tests influenced the changes implemented during wireframes design.Having three sets of wireframes (mobile, tablet and desktop) I used three several applications (inVision, Marvell App, atomic.io) and built interactive prototypes.At this point the user tests were repeated, not efficient elements removed or improved, the concepts revised and new assumptions created.User Centered DesignUser Centered DesignUser Centered Design methodology and its variety of research methods were keeping my focus on understanding motivations, goals and needs of the users and allowing to design the most optimal solutions that help the usersto achieve their goals and at the same timeaccelerate the business growth.I conducted several interviews, survey and tests. Tests conducted: card sorting; A/B, preference, click tests; user flows tests with interactive prototypes.Material Design LiteThe visual design of viffie is based on Material Design principles.The goal was to create neutral, yet friendly User Interface that matches different tastes. The most important points were to create a user interface that does not distract the user from work and to make sure that the user interactions support the task flows and are implemented in a logical and dynamic way.Production ReadyThe visual design of viffie is based on Material Design principles.The goal was to create neutral, yet friendly User Interface that matches different tastes. The most important points were to create a user interface that does not distract the user from work and to make sure that the user interactions support the task flows and are implemented in a logical and dynamic way.Production ReadyAll the information included in this document was collected and revised during the five iterations. The documentation was divided on three parts: Business Analysis, User Experience and Visual Design and was made accessible to every team member on dropbox.","link":"/2017/03/30/viffie/"},{"title":"dot it!","text":"Bored with the old media, we want a revolution in painting. We want easy to use, multi-dimensional painting that brings the new ways of describing reality.","link":"/2012/06/26/dotit/"},{"title":"asteroidOS","text":"Free and open source operating system for smartwaches.This intro and project details will soon be updated.","link":"/2017/09/26/asteroidos/"}],"tags":[{"name":"project","slug":"project","link":"/tags/project/"},{"name":"project someTAg","slug":"project-someTAg","link":"/tags/project-someTAg/"},{"name":"someTAg","slug":"someTAg","link":"/tags/someTAg/"},{"name":"-project -someTAg","slug":"project-someTAg","link":"/tags/project-someTAg/"}],"categories":[{"name":"project","slug":"project","link":"/categories/project/"},{"name":"indie","slug":"indie","link":"/categories/indie/"}]}